package main

import (
	"fmt"
	"math/rand"
	"net/http"
	"strconv"
	"time"
)

/**
注释：
1. 阴爻和阳爻
2. 八卦口诀：乾三连、坤六段、震仰盂、艮覆碗、离中需、坎中满、兑上缺、巽下断
3. 六十四卦：周文王将八卦两两重叠，变成了六十四卦
4. 卦辞和爻辞：六十四卦中，每一卦有六个爻。每一个卦有卦辞，每一个爻有爻辞
5. 六十四卦的爻的读法：从下到上，分别为初、二、三、四、五、上。如果是阳爻则称为九，如果是阴爻则称为六。
比如，一个卦的最下面是一个阳爻，那么就称该爻为初九。
6. 卦主：六爻中有为主之爻，称为卦主。卦主多取第五爻（从下往上数第五个）
7. 当位与不当位：初、三、五为奇数，称为阳位。二、四、上为偶数，称阴位。凡阳爻处于阳位，阴爻处于阴位
均称为当位，象征着事物的发展变化符合规律。否则称为不当位，象征着事物的发展变化违反规律
8. 爻画: 每摇动三枚铜钱投掷一次后，就得出一个爻画。投掷六次后就得到六个爻画。一个卦就由六个爻画组成。

卜卦的原则：
1. 卜卦时心境要平和
2. 每件事情只能预测一次，不可反复预测
3. 对于心意已决和自己能够判断的事情不需要预测
4. 预测结果：当为、不当为、如何为

变卦：
1. 变卦就是在本卦的变爻改变性质后，得到的新卦。
2. 其实就是 老阴变为老阳，老阳变为老阴

解卦：
什么是变爻：老阴和老阳其实就称为变爻。
一个卦得出后，根据是否要变爻，会有其中情况。
1. 情况一：六爻不变。根据本卦卦辞来解卦
2. 情况二：一个变爻。用这个变爻的爻辞来解卦
3. 情况三：两个变爻。用这两个变爻的爻辞来解卦，且以上爻的爻辞为佳。
4. 情况四：三个变爻。用本卦的卦辞结合变卦的卦辞来综合考虑
5. 情况五：四个变爻。用另外两个不变爻的爻辞来解卦，且以下爻爻辞为主。
6. 情况六：五个变爻。用变卦中不变爻的爻辞来解卦。
7. 情况七：六个变爻。如果是乾、坤两卦就用”用九“、”用六“来解卦。其他卦
就用变卦的卦辞来解卦。

*/

// 定义卦的结构体
type Gua struct {
	Name       string   // 卦名
	GuaCi      string   // 卦辞
	GuaCiJieXi string   // 卦辞解释
	YaoCi      []string // 爻辞，长度为6，分别表示初爻到上爻的爻辞
	YuYi       string   // 寓意
}

// 初始化六十四卦的信息
func initializeGuas() map[string]Gua {
	guas := make(map[string]Gua)

	guas["一"] = Gua{
		Name:       "乾卦",
		GuaCi:      "乾：元亨，利贞。",
		GuaCiJieXi: "乾卦象征天:创始、通达、和谐有利、正固持久。天之阳气是万物滋生之本，它开创万物并使其各自安顿本性与命运，人世间的发展变化也如天道般遵循规律运行。天的运行刚劲强健，君子悉应效法之，永不停息地发奋自强",
		YaoCi: []string{
			"初九：潜龙，勿用。	潜龙，养精蓄锐，待机而动，不可轻举妄动。处于初始阶段时，由于位卑力薄，一切还刚刚起步，需要养精蓄锐，有待于逐渐发展。",
			"九二：见龙在田，利见大人。		见龙，龙出现在地上，是遇见伟大人物的时机。龙已经崭露头角，才华受到注意了，这时见到大人是有利的，可以获得进一步的栽培与磨炼",
			"九三：君子终日乾乾，夕惕若，厉无咎。		惕龙，君子整天勤奋不休，日夜警惕戒备，即使面对危险，也不会有危害。当处于不上不下的危险阶段而事业将成未成时，由于无法确知下一步的发展，唯有本着乾卦的精神，日夜精进。",
			"九四：或跃在渊，无咎。		跃龙，或一跃而上，或退于渊中，审时度势，进退得宜，不会有问题。或上或下，要看时机与条件是否配合。保持这种状态，就不会有灾难了。",
			"九五：飞龙在天，利见大人。		飞龙，在空中飞腾，利于见大人，大展鸿图。主客观条件都已尽善尽美，这才是一飞冲天、大展鸿图的时候",
			"上九：亢龙，有悔。		亢龙，盛极必衰，飞到最高点，就会往下掉，以致后悔。盛极则衰，盈满易倾。如果进而不知退，往而不能返，事态就要走向反面",
		},
		YuYi: "人生最重要的是找到自己的位置。人生位置是由低到高，而且循序渐进的。每个位置上，有每个位置的表现与应该谨守的本分，不可逾越。人生在世，每个人都占有一个位置。如果你想得到好的位置，必须抓住时机。如果你德行出众，人家可能为你让出最好的位置。",
	}

	guas["二"] = Gua{
		Name:       "坤卦",
		GuaCi:      "坤：元亨，利牝马之贞。君子有攸往，先迷后得，主利。西南得朋，东北丧朋。安贞吉。",
		GuaCiJieXi: "坤卦象征地:元始，亨通，有利于像雌马一样以柔顺坚持正道。君子有所往，如果争先前行会误入歧途;如果随从人后，就会有人来做主，必然有利。向西南走会得到朋友，向东北走会失去朋友，这时安于坚持正道是吉祥的。坤卦的本质特征为柔顺，因此以柔顺的雌马作为象征。大地以厚重的身体托载万物。君子应该以大地般的宽厚胸怀去包容天下之事，包容天下之人。",
		YaoCi: []string{
			"初六：履霜，坚冰至。		踏踩在霜冻上面，便知道寒冷的冬天就要来了。不仅要细心察觉微小迹象，还要从中预测事物的发展趋势。",
			"六二：直方大，不习无不利。		为人正直、方正，所做的事情就会顺利，容易成功。一个人真正做到正直、端正、胸襟阔大，便可处处心安，无所不利",
			"六三：含章，可贞，或从王事，无成有终。	蕴含美德，收敛锋芒，为君王做事，谨守臣职，即使没有成绩，也会有好结局。含晦藏美，慎行免咎。即或从事君王赐命之事，也决不专有其功，功成亦不居功自傲，故能不受嫉害，而获善终。",
			"六四：括囊，无咎无誉。	把口袋束扎起来(约束自己，谨慎言行)，不会得到称誉，也不会招惹祸害。六四正处在一个嫌疑是非的敏感位置，为了免遭猜忌，必须像囊袋扎口封闭一样勿言勿动，才能避除祸患。",
			"六五：黄裳，元吉。	穿黄色的裳裙，大吉。黄为守中之色，象征中道，裳是下体的衣服，象征谦下。一个人处在高位时，也应恭顺谦下，这样他的事业才能吉祥如意，顺利发展。",
			"上六：龙战于野，其血玄黄。		两条龙在野地上交战，流出黑黄混杂的血。作为坤阴之道的辅佐者，要居卑而静，当其事业和声誉发展到极盛之时，必须警惕与乾阳争斗的局面出现。",
		},
		YuYi: "我们做人应当效法大地，以宽厚的德行，负载万物。面对阳刚的世界，最明智的选择就是以柔克刚。否则带给你的结局可能是头破血流。一个人有了本事，还得含蓄，如果太过张扬就容易招惹麻烦。不看重自己，卑以自牧，这才是智慧的光明远大。",
	}

	guas["三"] = Gua{
		Name:       "屯",
		GuaCi:      "屯：元亨，利贞，勿用有攸往，利建侯。",
		GuaCiJieXi: "屯卦象征始生:极为亨通，利于坚守正道。不宜有所前进，适宜建立侯王。从屯卦.上下二体的关系看，下卦为震为动，上卦为坎为险，是动而遇险之象。所以一般称创始的艰难为屯难",
		YaoCi: []string{
			"初九：磐桓，利居贞，利建侯。		前进遇到困难，徘徊流连，这时不宜行动，保持心志的端正与坚切，最终仍能建功封侯，前程远大。",
			"六二：屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字。		有人乘马来求婚，但行路踟蹰。贞洁的女子没有马上出嫁，十年后才出嫁(预示艰难，要守正待时)，摆脱创始时期的艰难十分不易，要耐心等待各种条件成熟。",
			"六三：即鹿无虞，惟入于林中，君子几不如舍，往吝。		在山林中追捕野鹿，没有向导帮助，就会迷失在林中。如果不放弃，继续追捕，就会有危险(知应变，当退则退)。创始艰难之际，处境困难，应守静以待，避免盲动。如有所为，也需借助外力，方能成功。当不具备出击条件的时候，面对利益诱惑，要断然放弃，以免身陷困境。",
			"六四：乘马班如，求婚媾，往吉，无不利。		乘马纷纷而来，是求婚者，前往应婚是吉利的。知己不足，求贤自辅，凡成大事业者无不是如此",
			"九五：屯其膏，小贞吉，大贞凶。		处于艰难草创之时，需要普施恩泽。柔小者，守持正道可获吉祥:刚大者，即使守正道也会有凶险。居上位者，必须广施恩泽，收揽人心才能得到辅佐",
			"上六：乘马班如，泣血涟如。		乘着马原地徘徊，血泪滴流不止。屯难之极:或归于灭亡;或屯极而通。无论出现哪一种可能，目前的困境都不会长久，穷极应积极思变。",
		},
		YuYi: "万物之始，充满生机。但它尚小，处处充满艰难。萌芽之苗，只要坚定参天之念，冬去春来，必定茁壮。人世间，只要我们锲而不舍，奋发进取，尽管开始幼稚，一介凡夫，但都有奠定伟业的可能。因为任何高贵都是可以锻炼而成的。",
	}

	guas["四"] = Gua{
		Name:       "蒙",
		GuaCi:      "蒙：亨，匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。",
		GuaCiJieXi: "蒙卦象征蒙昧:亨通。不是我去求蒙昧的童子，而是蒙昧的童子来求我。初次请问应该回答，对同一问题再三滥问，那是对先生的亵渎，就不再回答。利于守持正道。蒙卦的核心内容是论启蒙之道。在授教前，受教育者应先端正自己的学习态度，要具备主动积极的求知欲",
		YaoCi: []string{
			"初六：发蒙，利用刑人，用说桎梏，以往吝。		在启发、教育蒙味时，可以利用刑罚制度去约束。不过，不可轻率行事，否则会有艰难。在人的启蒙阶段，必须严加管教，才能避免他将来误入歧途",
			"九二：包蒙，吉。纳妇，吉；子克家。		对蒙昧的人有包容心，有教无类，故吉祥。启蒙者要有普度众生的博大胸襟，要有包容蒙昧的精神，无所遗弃",
			"六三：勿用娶女，见金夫，不有躬，无攸利。		见有钱有势的男子，便没了主见，不能娶这样的女子，不会有好结果。教育并非万能，品行不端的人是难以施教的",
			"六四：困蒙，吝。		困于蒙昧之中，这是憾事。蒙童没有知识，空空如也，所以要虚心向学，开发智慧。如果远离明师，不主动亲近，必然困于蒙昧。",
			"六五：童蒙，吉。		孩童傻乎乎的，吉祥(孩童无知是合乎自然规律的，因此吉祥)。童子蒙昧而吉祥，是因为他的恭顺和谦逊",
			"上九：击蒙，不利为寇，利御寇。		以猛击来启发蒙昧，过于暴烈是不利的，严防其为非作歹才是有利的。在教育愚昧之人时，方法不可太猛烈，要小心翼翼，循序渐进。",
		},
		YuYi: "人的性情是天生的，所以教育首先面对的不是蒙昧，而是懒惰。我们在成长的过程中，求学、做事、做人，都应积极主动，勤勉奋进。人最初都好像山下的泉水，潺潺细流；但是要勤勉，以果敢的行动，培育品德，最终将成为滔滔江河，滋生万物。",
	}

	guas["五"] = Gua{
		Name:       "需",
		GuaCi:      "需：有孚，光亨，贞吉。利涉大川。",
		GuaCiJieXi: "需卦象征等待:真诚地信守此道，前程光明而亨通，行于正途而获吉祥。利于涉越大河。需卦揭示的是等待的哲学。在事物的发展过程中遇到艰险时，要审时度势，耐心地等待时机。信守待时之道，以适时而进的态度去处理问题，才不会出现偏差，才能真正负担起跨越险阻、 涉过大川的重任。",
		YaoCi: []string{
			"初九：需于郊。利用恒，无咎。		在郊外等待，守常规，不轻举妄动，就不会有危险。需要耐心等待时，不可轻易冒险。",
			"九二：需于沙。小有言，终吉。		在沙地上等待，虽然有小挫折，但最后终会吉利。在险要的情势中镇定以待，可以避险",
			"九三：需于泥，致寇至。		在泥泞中等待，就像在招强盗那样，是危险的。临险谨慎，可以不败。",
			"九四：需于血，出自穴。		在血泊之地等待是凶险的，要设法脱离。即使在血泊之中，仍冷静地等待脱险的时机，能够如此行事，终究会化险为夷。",
			"九五：需于酒食，贞吉。		在酒食之中等待，预示未来吉祥。在艰险危困中仍能饮食自若、安然自乐、以待时变，这才是处险待时的大境界",
			"上六：入于穴，有不速之客三人来，敬之，终吉。	进入陷穴，有三个不速之客到来，对他们尊敬有礼，最后能获得吉利。处在不利退避的境地，要恭谨适变，不可强拒，只要充分利用自己的优势，就可以化凶为吉。",
		},
		YuYi: "没有春天，就没有百花；没有秋天，就没有硕果。一切都是时机使然。从乌云密布到滂沱大雨，需要等待；从嗷嗷待哺到展翅飞翔，也需要等待。当条件不成熟时，应尽情享受美食的乐趣，以等到有利时机的来临。此时，无为才能有为。等待是一种智慧。等待是一种美德。",
	}

	guas["六"] = Gua{
		Name:       "讼",
		GuaCi:      "讼：有孚，窒惕，中吉，终凶。利见大人，不利涉大川。",
		GuaCiJieXi: "讼卦象征争讼:内心诚实、克制、警惕。中途停止是吉祥的，争讼到底有凶险，利于出现大人，不利于涉越大河。讼卦不是救人如何争讼，而是告诫人如何止讼息争。要息讼我们首先要保持内心诚实，不感情用事，堵塞忿争之心，努力从自己这一方平息争讼。确实非争不可时，也要适可而止;见好就收，这才是最吉祥的结局。",
		YaoCi: []string{
			"初六：不永所事；小有言，终吉。		不要在事端中纠缠，少争辩，最终会吉祥。争端初起，略辩即明，不可长久纠缠于口舌之争。",
			"九二：不克讼，归而逋，其邑人三百户，无眚。		在争讼中不能胜出，逃到三百户人家的村子里，避免灾难。争讼失利，要及时终止以免除祸端",
			"六三：食旧德，贞厉，终吉；或从王事，无成。		坐享先前积的恩德，如果能安分守己，恪守常规(守持正固)，便能获得吉祥;或可跟从君王做事，但不会有什么成就。无力争讼者要退让免争。处危境而知道防危虑险，才能保持旧禄不失。即使在君王面前取得成绩，也不敢自己居功，如此谨慎必获得吉祥。",
			"九四：不克讼；复自命渝，安贞吉。		在争讼中不能胜诉，就重新安于本命，安分守己便可获吉祥。发现真理和道义不在自己一边时，应赶快回头，改变自己无理的态度，修正自己的行为，改正错误。这样的结果也是吉祥的",
			"九五：讼，元吉。		争讼(得到公正裁决)，吉祥。中正无私的主讼者，以明断曲直、公正严明的态度去处理争讼与纠纷，是最为吉祥的",
			"上九：或锡之鞶带，终朝三褫之。		或许会被赏赐精美的大带，但一天内会被三次索回。持强争讼不止，必有恶果。即使通过争讼而获得高官厚禄也极不光彩，必然受到舆论的谴责，结果还是保不住，甚至会身败名裂。",
		},
		YuYi: "我们的世界充满争讼和诉讼。就事物而言，一方阳刚，一方阴险，必定产生争执。就人而言，外有才干，内心阴险，必定与人争执。有争执的时候，唯有反省，戒慎恐惧，把握中庸，才是正确的。如若一味逞强，到头来虽胜犹输，一切皆凶。",
	}
	guas["七"] = Gua{
		Name:       "师",
		GuaCi:      "师：贞丈人吉，无咎。",
		GuaCiJieXi: "师卦象征军队:守持正道，以贤明长者为统帅，可以吉祥，无灾祸。战争有两大原则:一是要师出有名，是正义之师;二是要善于选择统帅，以贤明而富有经验和威望的将领统兵，这是出师胜利的关键",
		YaoCi: []string{
			"初六：师出以律，否臧凶。		军队出发行军时，纪律要严明，否则会有凶险。出兵打仗，军纪为先。必须以节制之师，依法度行事，才能所向披靡。军纪是取胜的前提，是军队的生命。",
			"九二：在师中，吉无咎，王三锡命。		统率军队，守持中道，可获吉祥，无灾祸。君王多次赐命嘉奖。将帅受命打仗，若过分专权，会引起君王的猜忌，从而引祸上身。因此将帅对军权分寸的掌握要适度。君王多次赏功，并非鼓励动兵，而是为了迅速结束战争，以安抚四方百姓。",
			"六三：师或舆尸，凶。		用军车载尸体，预示凶险。将领贪功冒进，盲目险行，结果大败而归，损失惨重。这种志大才疏的人绝非将帅之才。任用此等人统率军队，必有凶险。",
			"六四：师左次，无咎。		军队撤退驻守，没有灾祸。当战争形势对自己一方不利时，应该退守，保存实力，伺机反攻。",
			"六五：田有禽，利执言，无咎；长子帅师，弟子舆尸，贞凶。		六五:田野有禽兽(比喻外敌来袭)，利于捕捉，这不会有灾祸。长子统率军队，次子以车载尸而归，是凶险的。君王在处理战争问题时，用人要光明正大，任人唯贤，才是正道，才能防止凶险。如果弄虚作假，则凶",
			"上六：大君有命，开国承家，小人勿用。		君主颁发命令，论功行赏，分封诸侯、大夫。小人不可重用。小人有才无德，即使立了军功，也只能给予物质上的奖赏，绝对不能让他们获得掌权的机会。否则就会伺机作乱，危害国家。",
		},
		YuYi: "武力是凶恶的工具，战争为不得已的手段。以伸张正义而动武，会获得拥戴；但滥施暴力，则是祸端。在行使武力过程中，能把持中庸，还算庆幸。若听他人怂恿就会以车载尸。小人有功，大可奖赏。如若重用，必祸乱国家。",
	}

	guas["八"] = Gua{
		Name:       "比",
		GuaCi:      "比：吉。原筮，元永贞，无咎。不宁方来，后夫凶。",
		GuaCiJieXi: "比卦，吉祥。要经过慎重观察再决定是否亲附。如果所亲附者有尊长之德，可以长久不变，能够坚守正道，就不会有灾祸。从不安中刚刚过来，后到的会有凶祸。人与人之间能够相互协作是吉祥的，但选择亲附对象必须慎重。一旦看准，就要抓紧时机争取亲附。若心存观望，姗姗来迟，说明你缺乏诚意，结果当然不妙!地承载水，水滋润地，这象征两者相互依存。先王观此亲比之象，受到启发，因此通过分封诸侯国来亲近天下诸侯。",
		YaoCi: []string{
			"初六：有孚比之，无咎。有孚盈缶，终来有它，吉。		以诚信来相辅相亲，没有灾害。诚信的德行如同美酒注满了酒缸，会吸引很多人来依附，结果是吉祥的。与人结交，最重要的是心怀诚信，让人信赖。自己在不利的条件下，还能够以诚待人，终究会有意外的吉祥。",
			"六二：比之自内，贞吉。		在内部亲密团结，结果是吉祥的。从内部进行团结、联合，这是一切团结、联合的前提。要想成就一番大事业，首先要稳定内部的阵脚。这也是进一步团结、联合其他力量的重要前提。",
			"六三：比之匪人。		与不正派的人结党营私。与行为不端正的人结交肯定结局悲惨。因为不正派的人一天到晚只会唱反调，而且和你离心离德，所以对这种人只能是远离。",
			"六四：外比之，贞吉。		与外界的人亲和，吉祥。在搞好自己内部团结的基础上，进一步和外部力量进行团结、联合，这是应该肯定和提倡的。但团结外部人员必须有所选择。那些德才兼备，能够听从统一指挥的人士，才是我们应该联合的对象。",
			"九五：显比；王用三驱，失前禽，邑人不诫，吉。		大公无私因而受到广泛的拥戴，君王打猎时只是三面包围，那些迎面跑来的动物就不射杀，网开一面让它们逃走。随从知道君王爱护生灵的用意，也不做警备，这是吉利的兆头。建立联合统一阵线要本着自觉自愿、来去自由的原则，不勉强，不迫从，应网开一面。对于一些本来无意加入这个组织的人，纵然勉强使之加入，往往也是貌合神离，不仅于自己的事业无补，有时甚至是有危害的。",
			"上六：比之无首，凶。		上六:小人互相倾轧，不能团结一心，凶兆。不论是亲附于人，还是为人所亲附，都要正而不邪，心怀诚信",
		},
		YuYi: "人要远离孤独，必须学会与人相亲相辅。地得水而柔，水得地而流。我们应当效仿大地与水，相互依存，和平共处。幸福的根本在于团结，相伴的原则是和谐美满。只要我们能够择善而友、远恶亲贤、包容而不强求，我们就不会孤独。",
	}

	guas["九"] = Gua{
		Name:  "小畜",
		GuaCi: "小畜：亨。密云不雨，自我西郊。",
		YaoCi: []string{
			"初九：复自道，何其咎？吉。		自己从原路返回，哪里会有什么灾害呢?吉祥。在困顿中，应当坚持当初纯正的动机。",
			"九二：牵复，吉。		带着别人一道从原路返回，吉祥。在突破阻碍时，应与同志携手并进，并把握中庸的原则。",
			"九三：舆说辐，夫妻反目。		行在半路上，忽然大车的轮条从车轮中脱出来，车不能再行了，回到家里，夫妻因此大吵而反目。在突破阻碍时应断然摆脱羁绊",
			"六四：有孚血去，惕出无咎。		具有诚实守信的德行，互相信任;抛弃忧患意识与戒备心理，这样就没有灾祸。在突破障碍时，应一本诚信，就可得到应援。",
			"九五：有孚挛如，富以其邻。		具有诚信的德行，与别人紧密联系并互相帮助，自已致富也要使邻人跟着一起富起来。只要排除私欲，有携手共进的诚信，不但自己富有，也要邻居富有，就能得到邻居的协助",
			"上九：既雨既处，尚德载，妇贞厉。月几望，君子征凶。		密云已经降雨，阳气已经被畜止，高尚的功德已经圆满。妇人应该坚守正道以防危险，要像月亮将圆而不过盈。此时君子如果继续前进，将有灾祸。因满招损，反而凶险，蓄积应当适可而止",
		},
		GuaCiJieXi: "小畜卦象征微小的蓄聚:亨通。 从西方吹来的浓云密布，却不降雨。小畜卦由一阴五阳组成。六四阴爻居柔位，是最恰当的正位。上下五个阳爻都来呼应，是一阴蓄五阳之象。下雨是阴阳二气和合的结果。西来的乌云密布，但还没有降雨，这说明六四阴爻力量弱小，聚阳甚微，还不足以和阳成雨。所以只能采取柔顺的方式蓄聚五个阳爻。君子观此象，应该想到，要效法风行天上积聚力量之象，不断地蓄养自己的德行，使之逐渐充实，趋于完美。",
		YuYi:       "人总有成熟和稳重的那一天，成熟和稳重需要积累；人也有成功和凯旋的那一刻，成功和凯旋需要积累。缺月总有圆之时，小溪终将汇入江海。当梦想还未实现，就需要积蓄道德和才华。因为机会只青睐有准备的人。",
	}

	guas["十"] = Gua{
		Name:  "履",
		GuaCi: "履：履虎尾，不咥人，亨。",
		YaoCi: []string{
			"初九：素履，往无咎。	心地纯朴、品行端正，处处小心行事，那么无论到什么地方都没有灾祸。初入社会，做事应该本分自然，虽然未必得吉，起码可以没有过错。",
			"九二：履道坦坦，幽人贞吉。		小心行走在平坦宽广的大道上，幽居的人安于闲逸恬静的生活，结果是吉祥的。不因人间的纷争而扰乱自己的精神境界。内心安静恬淡，道路自然坦荡。",
			"六三：眇能视，跛能履，履虎尾，咥人，凶；武人为于大君。		独眼却自以为能看，跛脚却自以为能行。不小心踩在老虎尾巴上，老虎回头就咬人，有凶险。这是一介武夫，只能效力于大人君主。以匹夫之勇盲目妄动是凶险的像这样的人，若把他置于大人君主的指挥下，倒是可以发挥他不怕危险的长处。",
			"九四：履虎尾，愬愬，终吉。		跟在老虎尾巴后面走路，感到恐惧害怕，但谨慎小心，最终可得到吉祥。以小心谨慎的态度行事，自然不会出错履危知惧，可化险得吉",
			"九五：夬履，贞厉。		刚毅果断，小心行动，要提防危险。当权者拥有绝对权威，但要防止武断独行。如果行事独断，听不进反面意见，长此以往，必有危险。",
			"上九：视履考祥，其旋元吉。		回顾行动的历程，详细观看一下吉凶祸福，自己、省悟，大吉。处履之终应该总结经验教训。把慎行的精神贯彻始终，获得最终的元吉，才是大有福庆的事，才是履之道的圆满实现。",
		},
		GuaCiJieXi: "履卦象征行走:跟在老虎尾巴后面行走，老虎却不咬人，亨通。立身处事，不可大意，要有如履虎尾的危机感。以如此谨慎的 态度处事，不会出差错。",
		YuYi:       "成功总是在前方，总是离我们有一段距离。要成功，总是要前行。前行要执着，但忌一意孤行。要大胆穿越，但应如履薄冰，谨言慎行。",
	}

	guas["十一"] = Gua{
		Name:  "泰",
		GuaCi: "泰：小往大来，吉亨。",
		YaoCi: []string{
			"初九：拔茅茹，以其汇，贞吉。		拔起了茅草，根系牵连而并出，因为它们是同类。自进可获吉祥。君子要像拔茅草一样，连带出同类。不仅自己上进，还要带动同类一起前进。",
			"九二：包荒，用冯河，不遐遗；朋亡，得尚于中行。		有包容大川似的宽广胸怀，可以徒步涉过大河急流;礼贤下士，对远方的贤德之人也不遗弃;不结成小团体，不结党营私，能够辅佐公正有道德的君主。君子应胸怀宽广有独涉大河的勇气，不遗弃贤德之人，不结党营私",
			"九三：无平不陂，无往不复；艰贞无咎。勿恤其孚，于食有福。		没有总是平地而不见陡坡的，没有只前进而不回来的:处在艰难困苦的环境中坚守正道就没有灾害，不要怕不能取信于人，安心享用自己的俸禄是很有福分的。物极必反是大自然的规律，但人不是对此无能为力的。人可以积极发挥自己的主观能动性，当处安泰之时，要居安思危，安逸时勿放松警惕，未雨时当思绸缪，见微知著，反思自己之所为是否处在正道。",
			"六四：翩翩，不富以其邻，不戒以孚。		虚怀若谷，这样与邻居相处，不互相戒备，彼此以诚相见，讲求信用。居安思危，仍应该团结，不可掉以轻心",
			"六五：帝乙归妹，以祉元吉。		帝乙嫁妹，以此得福，大吉大利。天子帝己是一位谦虚为怀、待下以宽的贤明之君。他在大好环境下将妹妹下嫁给德才兼备的下属，当然吉庆祥和。这说明在政通人和的安泰时期，尤其需要选贤任能，亲贤臣而远小人。",
			"上六：城复于隍；勿用师，自邑告命，贞吝。		城墙倒塌在久已干涸的护城壕沟里;这时决不可进行战争，应减少繁琐的政令，以防止可能出现的土崩瓦解的局面。泰极而否，颓势已显现，只可进行防御，让损害减到最低限度，不可逞强力图挽救。",
		},
		GuaCiJieXi: "泰卦象征通泰:阴气上升，阳气下降，吉祥而亨通。阴阳代表万事万物对立的两个方面，它们不但处于对立状态，也会和谐地统一在一起，这就是“阴阳相交”。",
		YuYi:       "有了天与地的沟通，才能产生雾雨雷电，才能出现春夏秋冬，才能结出繁花硕果。痛苦与痛苦沟通了才会变淡，欢乐与欢乐沟通了才会变浓。人与人之间沟通了才会相互理解。有了沟通才会亨通泰平。因为天地通泰，所以万物生长。因为国家通泰，所以安民兴邦。",
	}

	guas["十二"] = Gua{
		Name:  "否",
		GuaCi: "否：否之匪人，不利君子贞，大往小来。",
		YaoCi: []string{
			"初六：拔茅茹，以其汇，贞吉，亨。		拔起茅草，根系牵连而并出，因为它们是同类。君子守持正道可获吉祥，亨通。在上下闭塞的乱世之初，小人即将得势，君子应精诚团结，防患于未然",
			"六二：包承，小人吉；大人否，亨。		包容奉承，小人得吉;大人闭塞，可获亨通。在闭塞时期，君子应当觉悟，了解适者生存的道理，自保以等待机会。",
			"六三：包羞。		由于受纵容而胡作非为，终于招致羞辱。乱世中的小人为了高攀，以媚态奉承上级。但上级是个正人君子，不愿与之同流合污，当即加以责备使其蒙羞。",
			"九四：有命，无咎，畴离祉。		奉行天命，替天行道，开通闭塞，没有灾祸，大家互相依附，都可以获得福分。人们必须顺应客观规律，利用恰当的时机，因势利导地推动转否为泰。当时机成熟时，大家齐心协力，必获成功，都会一起享福",
			"九五：休否，大人吉；其亡其亡，系于苞桑。		时世闭塞的局面将要停止，大人可获吉祥:居安思危，常常以“即将灭亡”的警句来提醒自己，才能像丛生桑树纠结的根那样牢固，安然无事。排除小人势力的时机已经到来，但仍应该谨慎从事，居安思危。越是在即将成功的关键时刻，越要防止败亡。",
			"上九：倾否，先否后喜。		时世闭塞不通的局面将要改变，会发生翻天覆地的变化;起初闭塞不通，后来顺畅通达，大家欢喜高兴。在上下闭塞的乱世穷极之时，应当趁势而起，一举倾覆否塞的局面。否极则泰，物极必反，这是自然法则的必然趋势。",
		},
		GuaCiJieXi: "否卦象征闭塞:闭塞不是人间正道，不利于君子坚守正义。阳气往上升，阴气向下降。“否”是阴阳不交、天地闭塞而万物不生之象，是乱世的象征。身处乱世中的君子由此领悟，要收敛修德以避开灾祸，不可谋取禄位来显耀自己。",
		YuYi:       "天地闭塞，畅流断，鸟音绝。这时候，鱼儿最好不浮头，鸟儿最好不飞翔。世局否闭，无邦国，兴乱世。这时候，才华最好不显露，爵禄最好不贪求。阴阳运行，时移世易。物极则必反，否极泰将至。谁没有辗转过黑夜？谁没有跋涉过冬天？",
	}
	guas["十三"] = Gua{
		Name:  "同人",
		GuaCi: "同人：同人于野，亨，利涉大川，利君子贞。",
		YaoCi: []string{
			"初九：同人于门，无咎。		与门外之人和睦共处，必无过错。走出门外去与人和睦共处，不分亲疏厚薄，这样做当然无人怪罪。这就超越了一门之内的狭隘关系，打破了门户之见。",
			"六二：同人于宗，吝。		只和本宗本派的人和睦相处，会有弊病。进到门里与同宗族的人同心同德，把宗族以外的人都抛在门外，对人亲疏有间、厚薄不一、心胸狭隘，不能出自大公，违背了同人的大格局，其弊病不言自明",
			"九三：伏戎于莽，升其高陵，三岁不兴。		把军队埋伏在密林草莽之中，占据附近的制高点频频晾望，三年都不敢出兵打仗。为争夺同盟者而兵戎相见。登高膝望敌情，深感对方实力雄厚，以至三年也不敢交战。",
			"九四：乘其墉，弗克攻，吉。		准备登城向敌人进攻，但终于没有进攻，是吉祥的。与人和睦共处应以道义为准则。以武力去勉强他人的同盟，不仅有愧于道义，也是极不明智的。求人之同，首先要求心之同。当明白自己的行为不够正义，便困而知返，退而不攻，结果仍然是吉祥的",
			"九五：同人先号啕而后笑，大师克相遇。		与人和睦相处，开始大声痛哭，后来破涕为笑，大军作战告捷，志同道合者相会在一起。同人之道重在求心之同。心同意同，不用强求而自同。心同志同，就可以克服障碍，实现和睦共处",
			"上九：同人于郊，无悔。	在荒郊也愿意与人和睦相处，未遇到志同道合者，也不后悔。	远离人群，是因为不愿同流合污，所以不会懊悔。与人和同，应当积极，不可逃避自命清高，脱离群众的孤僻态度，是不值得称颂的。",
		},
		GuaCiJieXi: "同人卦象征和睦相处:在旷野中集合群众，象征在广阔的范围，公平无私地与人相处，当然一切亨通。同舟共济，万众一心,可以涉越江海。众人聚合可以齐力做正事，也能一起做坏事，唯有君子固守正道，方才有利",
		YuYi:       "远离人群，虽可避同流合污；避世清高，却不被褒奖赞扬。众人和同，需拥有正义友爱；和睦共处，方可以齐力建家。",
	}

	guas["十四"] = Gua{
		Name:  "大有",
		GuaCi: "大有：元亨。",
		YaoCi: []string{
			"初九：无交害，匪咎，艰则无咎。",
			"九二：大车以载，有攸往，无咎。",
			"九三：公用亨于天子，小人弗克。",
			"九四：匪其彭，无咎。",
			"六五：厥孚交如，威如，吉。",
			"上九：自天祐之，吉无不利。",
		},
		GuaCiJieXi: "大有指大有收获，至为亨通。该卦唯一的阴爻六五在尊位得中，统领五个阳爻，就像君王统领天下，心怀万民。",
		YuYi:       "以谦逊诚信待人，以威信确保秩序，亏而不妥，满而不溢，恩威并施，大事可立。不大其所有，方可保其大有。",
	}

	guas["十五"] = Gua{
		Name:  "谦",
		GuaCi: "谦：亨，君子有终。",
		YaoCi: []string{
			"初六：谦谦君子，用涉大川，吉。",
			"六二：鸣谦，贞吉。",
			"九三：劳谦，君子有终，吉。",
			"六四：无不利，损谦，",
			"六五：不富以其邻，利用侵伐，无不利。",
			"上六：鸣谦，利用行师，征邑国。",
		},
		GuaCiJieXi: "谦卦象征谦虚:亨通，君子能够保持谦虚至终",
		YuYi:       "天的法则：月满则损。地的法则：以高填低。人的法则：损骄益谦。人得意，易令其山穷水尽；人谦卑，会使你无往不利。谦虚是一种美德，适合隐匿在内心，不能形诸于外表。",
	}

	guas["十六"] = Gua{
		Name:  "豫",
		GuaCi: "豫：利建侯，行师。",
		YaoCi: []string{
			"初六：鸣豫，凶。",
			"六二：介于石，不终日，贞吉。",
			"六三：盱豫，悔；迟有悔。",
			"九四：由豫，大有得；勿疑。朋盍簪。",
			"六五：贞疾，恒不死。",
			"上六：冥豫，成有渝，无咎。",
		},
		GuaCiJieXi: "豫卦象征欢乐:利于建立诸侯，出兵征战。",
		YuYi:       "春种夏收，夜息日作。我们因应时势，所以快乐。择善而从，择祥而居。我们和睦友好，所以欢乐。如若乐而忘忧，放纵自我，就会祸由喜生。只有居安思危，处乐如戒，才能确保吉利。乐中知不乐，才会常乐。",
	}

	guas["十七"] = Gua{
		Name:  "随",
		GuaCi: "随：元亨利贞，无咎。",
		YaoCi: []string{
			"初九，官有渝，贞吉，出门交有功。",
			"六二，系小子，失丈夫。",
			"六三，系丈夫，失小子。随有求得，利居贞。",
			"九四，随有获，贞凶。有孚在道以明，何咎。",
			"九五，孚于嘉，吉。",
			"上六，拘系之，乃从维之，王用亨于西山。",
		},
		GuaCiJieXi: "随卦象征随从:至为亨通，利于坚守正道，没有危害",
		YuYi:       "人与人之间，个人利益往往会有冲突，有时必须舍弃个人的私见，随和众意，才能维系安和乐利的社会。做到了随和，也就没有了自己的固执，为了大众的利益，可以变通，但并不违反原则。可以择善固执，但不会同流合污。",
	}

	guas["十八"] = Gua{
		Name:  "蛊",
		GuaCi: "蛊：元亨，利涉大川，先甲三日，后甲三日。",
		YaoCi: []string{
			"初六：干父之蛊，有子，考无咎，厉终吉。",
			"九二：干母之蛊，不可贞。",
			"九三：干父之蛊，小有悔，无大咎。",
			"六四：裕父之蛊，往见吝。",
			"六五：干父之蛊，用誉。",
			"上九：不事王侯，高尚其事。",
		},
		GuaCiJieXi: "蛊卦象征除弊治乱:至为亨通，利于涉越大河。在事情开始前的三天内要调查研究，周密计划;在事情开始后的三天内要监督执行，补救缺失",
		YuYi:       "挽救破败的事业，必定艰苦，要不怕万难。在处理的过程中，不要过于谴责过去，应着眼于将来。要把握中庸的原则，不可采取过于刚强的手段，但也不能宽容妥协。",
	}

	guas["十九"] = Gua{
		Name:  "临",
		GuaCi: "临：元亨，利贞。至于八月有凶。",
		YaoCi: []string{
			"初九：咸临，贞吉。",
			"九二：咸临，吉，无不利。",
			"六三：甘临，无攸利；既忧之，无咎。",
			"六四：至临，无咎。",
			"六五：知临，大君之宜，吉。",
			"上六：敦临，吉，无咎。",
		},
		GuaCiJieXi: "临卦象征以上临下:极为亨通，利于坚持正道。到了八月将有凶险。",
		YuYi:       "领导者应该以高尚的人格去感召民众，恩威并济，不可空言诱骗。应运用智慧，选拔贤能，厚待百姓。不可以威压人，以暴虐民。以德临人，万民才会心悦诚服。仁政天下，社会才能长治久安。",
	}

	guas["二十"] = Gua{
		Name:  "观",
		GuaCi: "观：盥而不荐，有孚顒若。",
		YaoCi: []string{
			"初六：童观，小人无咎，君子吝。",
			"六二：窥观，利女贞。",
			"六三：观我生，进退。",
			"六四：观国之光，利用宾于王。",
			"九五：观我生，君子无咎。",
			"上九：观其生，君子无咎。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["二十一"] = Gua{
		Name:  "噬嗑",
		GuaCi: "噬嗑：亨，利用狱。",
		YaoCi: []string{
			"初九：履校灭趾，无咎。",
			"六二：噬肤灭鼻，无咎。",
			"六三：噬腊肉遇毒；小吝，无咎。",
			"九四：噬乾胏得金矢；利艰贞，吉。",
			"六五：噬乾肉得黄金；贞厉，无咎。",
			"上九：何校灭耳，凶。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["二十二"] = Gua{
		Name:  "贲",
		GuaCi: "贲：亨。小利有攸往。",
		YaoCi: []string{
			"初九：贲其趾，舍车而徒。",
			"六二：贲其须。",
			"九三：贲如，濡如，永贞吉。",
			"六四：贲如，皤如，白马翰如；匪寇婚媾。",
			"六五：贲于丘园，束帛戋戋；吝，终吉。",
			"上九：白贲，无咎。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["二十三"] = Gua{
		Name:  "剥",
		GuaCi: "剥：不利有攸往。",
		YaoCi: []string{
			"初六：剥床以足，蔑，贞凶。",
			"六二：剥床以辨，蔑，贞凶。",
			"六三：剥之，无咎。",
			"六四：剥床以肤，凶。",
			"六五：贯鱼以宫人宠，无不利。",
			"上九：硕果不食，君子得舆，小人剥庐。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["二十四"] = Gua{
		Name:  "复",
		GuaCi: "复：亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。",
		YaoCi: []string{
			"初九：不复远，无只悔，元吉。",
			"六二：休复，吉。",
			"六三：频复，厉无咎。",
			"六四：中行独复。",
			"六五：敦复，无悔。",
			"上六：迷复，凶，有灾眚。用行师，终有大败。以其国君凶。至于十年不克征。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["二十五"] = Gua{
		Name:  "无妄",
		GuaCi: "无妄：元亨，利贞。其匪正有眚，不利有攸往。",
		YaoCi: []string{
			"初九：无妄，往吉。",
			"九二：不耕获，不菑畲，则利有攸往。",
			"六三：无妄之灾，或系之牛，行人之得，邑人之灾。",
			"九四：可贞，无咎。",
			"九五：无妄之疾，勿药有喜。",
			"上九：无妄，行有眚，无攸利。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["二十六"] = Gua{
		Name:  "大畜",
		GuaCi: "大畜：利贞，不家食吉，利涉大川。",
		YaoCi: []string{
			"初九：有厉，利已。",
			"九二：舆说輹。",
			"九三：良马逐，利艰贞，曰闲舆卫，利有攸往。",
			"六四：童牛之牿，元吉。",
			"六五：豶豕之牙，吉。",
			"上九：何天之衢，亨。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["二十七"] = Gua{
		Name:  "颐",
		GuaCi: "颐：贞吉。观颐，自求口实。",
		YaoCi: []string{
			"初九：舍尔灵龟，观我朵颐，凶。",
			"六二：颠颐，拂经，于丘颐，征凶。",
			"六三：拂颐，贞凶，十年勿用，无攸利。",
			"六四：颠颐，吉；虎视眈眈，其欲逐逐，无咎。",
			"六五：拂经，居贞吉，不可涉大川。",
			"上九：由颐；厉吉，利涉大川。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["二十八"] = Gua{
		Name:  "大过",
		GuaCi: "大过：栋挠，利有攸往，亨。",
		YaoCi: []string{
			"初六：藉用白茅，无咎。",
			"九二：枯杨生稊，老夫得其女妻，无不利。",
			"九三：栋桡，凶。",
			"九四：栋隆，吉，有它，吝。",
			"九五：枯杨生华，老妇得士夫，无咎无誉。",
			"上六：过涉灭顶，凶，无咎。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["二十九"] = Gua{
		Name:  "坎",
		GuaCi: "坎：有孚，维心亨，行有尚。",
		YaoCi: []string{
			"初六：习坎，入于坎窞，凶。",
			"九二：坎有险，求小得。",
			"六三：来之坎坎，险且枕，入于坎窞，勿用。",
			"六四：樽酒，簋贰，用缶，纳约自牖，终无咎。",
			"九五：坎不盈，只既平，无咎。",
			"上六：用徽繹，置于丛棘，三岁不得，凶。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["三十"] = Gua{
		Name:  "离",
		GuaCi: "离：利贞，亨；畜牝牛吉。",
		YaoCi: []string{
			"初九：履错然，敬之，无咎。",
			"六二：黄离，元吉。",
			"九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。",
			"九四：突如其来如，焚如，死如，弃如。",
			"六五：出涕沱若，戚嗟若，吉。",
			"上九：王用出征，有嘉折首，获其匪丑，无咎。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["三十一"] = Gua{
		Name:  "咸",
		GuaCi: "咸：亨，利贞，取女吉。",
		YaoCi: []string{
			"初六：咸其拇。",
			"六二：咸其腓，凶；居吉。",
			"九三：咸其股，执其随，往吝。",
			"九四：贞吉，悔亡；憧憧往来，朋从尔思。",
			"九五：咸其脢，无悔。",
			"上六：咸其辅颊舌。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["三十二"] = Gua{
		Name:  "恒",
		GuaCi: "恒：亨，无咎，利贞，利有攸往。",
		YaoCi: []string{
			"初九：浚恒，贞凶，无攸利。",
			"九二：悔亡。",
			"九三：不恒其德，或承之羞，贞吝。",
			"九四：田无禽。",
			"六五：恒其德，贞，妇人吉，夫子凶。",
			"上六：振恒，凶。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}
	guas["三十三"] = Gua{
		Name:  "遁",
		GuaCi: "遁：亨，小利贞。",
		YaoCi: []string{
			"初六：遁尾，厉，勿用有攸往。",
			"六二：执之用黄牛之革，莫之勝说。",
			"九三：系遁，有疾厉，畜臣妾，吉。",
			"九四：好遁，君子吉，小人否。",
			"九五：嘉遁，贞吉。",
			"上九：肥遁，无不利。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["三十四"] = Gua{
		Name:  "大壮",
		GuaCi: "大壮：利贞。",
		YaoCi: []string{
			"初九，壮于趾，征凶，有孚。",
			"九二，贞吉。",
			"九三，小人用壮，君子用罔，贞厉，羝羊触藩，羸其角。",
			"九四，贞吉，悔亡，藩决不羸，壮于大舆之輹。",
			"六五，丧羊于易，无悔。",
			"上六，羝羊触藩，不能退，不能遂，无攸利，艰则吉。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["三十五"] = Gua{
		Name:  "晋",
		GuaCi: "晋：康侯用锡马蕃庶，昼日三接。",
		YaoCi: []string{
			"初六，晋如摧如，贞吉。罔孚，裕无咎。",
			"六二，晋如，愁如，贞吉。受兹介福，于其王母。",
			"六三，众允，悔亡。",
			"九四，晋如硕鼠，贞厉。",
			"六五，悔亡，失得，勿恤，往吉，无不利。",
			"上九，晋其角，维用伐邑，厉吉，无咎，贞吝。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["三十六"] = Gua{
		Name:  "明夷",
		GuaCi: "明夷：利艰贞。",
		YaoCi: []string{
			"初九，明夷于飞，垂其翼。君子于行，三日不食，有攸往，主人有言。",
			"六二，明夷，夷于左股，用拯马壮，吉。",
			"九三，明夷于南狩，得其大首，不可疾贞。",
			"九四，入于左腹，获明夷之心，出于门庭。",
			"六五，箕子之明夷，利贞。",
			"上六，不明晦，初登于天，后入于地。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["三十七"] = Gua{
		Name:  "家人",
		GuaCi: "家人：利女贞。",
		YaoCi: []string{
			"初九，闲有家，悔亡。",
			"六二，无攸遂，在中馈，贞吉。",
			"九三，家人嗃嗃，悔厉吉，妇子嘻嘻，终吝。",
			"六四，富家，大吉。",
			"九五，王假有家，勿恤，吉。",
			"上九，有孚威如，终吉。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["三十八"] = Gua{
		Name:  "睽",
		GuaCi: "睽：小事吉。",
		YaoCi: []string{
			"初九，悔亡，丧马勿逐，自复。见恶人，无咎。",
			"九二，遇主于巷，无咎。",
			"六三，见舆曳，其牛掣，其人天且劓，无初有终。",
			"九四，睽孤，遇元夫，交孚，厉无咎。",
			"六五，悔亡，厥宗噬肤，往何咎？",
			"上九，睽孤，见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇，婚媾。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["三十九"] = Gua{
		Name:  "蹇",
		GuaCi: "蹇：利西南，不利东北；利见大人，贞吉。",
		YaoCi: []string{
			"初六，往蹇，来誉。",
			"六二，王臣蹇蹇，匪躬之故。",
			"九三，往蹇来反。",
			"六四，往蹇来连。",
			"九五，大蹇朋来。",
			"上六，往蹇来硕，利见大人。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["四十"] = Gua{
		Name:  "解",
		GuaCi: "解：利西南，无所往，其来复吉。有攸往，夙吉。",
		YaoCi: []string{
			"初六，无咎。",
			"六二，田获三狐，得黄矢，贞吉。",
			"九三，负且乘，致寇至，贞吝。",
			"九四，解而拇，朋至斯孚。",
			"六五，君子维有解，吉，有孚于小人。",
			"上六，公用射隼于高墉之上，获之，无不利。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["四十一"] = Gua{
		Name:  "损",
		GuaCi: "损：有孚，元吉，无咎，可贞，利有攸往。曷之用？二簋可用享。",
		YaoCi: []string{
			"初九，已事遄往，无咎，酌损之。",
			"九二，利贞，征凶，弗损益之。",
			"六三，三人行，则损一人，一人行，则得其友。",
			"六四，损其疾，使遄有喜，无咎。",
			"六五，或益之，十朋之龟弗克违，永贞吉。王用享于帝，吉。",
			"上九，弗损益之，无咎，贞吉，有攸往，得臣无家。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["四十二"] = Gua{
		Name:  "益",
		GuaCi: "益：利有攸往，利涉大川。",
		YaoCi: []string{
			"初九，利用为大作，元吉，无咎。",
			"六二，或益之，自外来，以贲自介。",
			"六三，益之，用凶事，无咎。有孚中行，告公用圭。",
			"六四，中行，告公从，利用为依迁国。",
			"九五，有孚惠心，勿问，元吉，有孚惠我德。",
			"上六，莫益之，或击之，立心勿恒，凶。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["四十三"] = Gua{
		Name:  "夬",
		GuaCi: "夬：扬于王庭，孚号，有厉。告自邑，不利即戎，利有攸往。",
		YaoCi: []string{
			"初九，壮于前趾，往不胜为吝。",
			"九二，惕号，莫夜有戎，勿恤。",
			"九三，壮于，有凶。君子夬夬，独行遇雨，若濡有愠，无咎。",
			"九四，臀无肤，其行次且，厉，无大咎。",
			"六五，讼元吉。",
			"上九，或锡之鞶带，终朝三褫之。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["四十四"] = Gua{
		Name:  "姤",
		GuaCi: "姤：女壮，勿用取女。",
		YaoCi: []string{
			"初六，系于金柅，贞吉，有攸往，见凶，赢其舆，其心不快。",
			"九二，包有鱼，无咎，不利宾。",
			"九三，臀无肤，其行次且，厉，无大咎。",
			"九四，包无鱼，起凶。",
			"九五，以杞包瓜，含章，有陨自天。",
			"上九，姤其角，吝，无咎。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["四十五"] = Gua{
		Name:  "萃",
		GuaCi: "萃：亨。王假有庙，利见大人，亨，利贞。用大牲吉，利有攸往。",
		YaoCi: []string{
			"初六，有孚不终，乃乱乃萃，若号一握为笑，勿恤，往无咎。",
			"六二，引吉，无咎，孚乃利用禴。",
			"六三，萃如，嗟如，无攸利，往无咎，小吝。",
			"九四，大吉，无咎。",
			"九五，萃有位，无咎，匪孚，元永贞，悔亡。",
			"上六，赍咨涕洟，无咎。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["四十六"] = Gua{
		Name:  "升",
		GuaCi: "升：元亨，用见大人，勿恤。南征吉。",
		YaoCi: []string{
			"初六，允升，大吉。",
			"九二，孚乃利用禴，无咎。",
			"九三，升虚邑。",
			"六四，王用亨于岐山，吉无咎。",
			"六五，贞吉，升阶。",
			"上六，冥升，利于不息之贞。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}
	guas["四十七"] = Gua{
		Name:  "困",
		GuaCi: "困：亨，贞，大人吉，无咎，有言不信。",
		YaoCi: []string{
			"初六，臀困于株木，入于幽谷，三岁不见。",
			"九二，困于酒食，朱绂方来，利用享祀，征凶，无咎。",
			"六三，困于石，据于蒺藜，入于其宫，不见其妻，凶。",
			"九四，来徐徐，困于金车，吝，有终。",
			"九五，劓刖，困于赤绂，乃徐有说，利用祭祀。",
			"上六，困于葛藟，于臲卼，曰动悔，有悔，征吉。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["四十八"] = Gua{
		Name:  "井",
		GuaCi: "井：改邑不改井，无丧无得，往来井井。汔至，亦未繘井，羸其瓶，凶。",
		YaoCi: []string{
			"初六，井泥不食，旧井无禽。",
			"九二，井谷射鲋，瓮敝漏。",
			"九三，井渫不食，为我民恻，可用汲，王明，并受其福。",
			"六四，井甃，无咎。",
			"九五，井洌，寒泉食。",
			"上六，井收勿幕，有孚元吉。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["四十九"] = Gua{
		Name:  "革",
		GuaCi: "革：己日乃孚，元亨利贞，悔亡。",
		YaoCi: []string{
			"初九，鞏用黄牛之革。",
			"六二，己日乃革之，征吉，无咎。",
			"九三，征凶，贞厉，革言三就，有孚。",
			"九四，悔亡，有孚改命，吉。",
			"九五，大人虎变，未占有孚。",
			"上六，君子豹变，小人革面，征凶，居贞吉。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["五十"] = Gua{
		Name:  "鼎",
		GuaCi: "鼎：亨。小利贞。",
		YaoCi: []string{
			"初六，鼎颠趾，利出否，得妾以其子，无咎。",
			"九二，鼎有实，我仇有疾，不我能即，吉。",
			"九三，鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。",
			"九四，鼎折足，覆公餗，其形渥，凶。",
			"六五，鼎黄耳金铉，利贞。",
			"上九，鼎玉铉，大吉，无不利。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["五十一"] = Gua{
		Name:  "震",
		GuaCi: "震：亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。",
		YaoCi: []string{
			"初九，震来虩虩，后笑言哑哑，吉。",
			"六二，震来厉，亿丧贝，跻于九陵，勿逐，七日得。",
			"六三，震苏苏，震行无眚。",
			"六四，震遂泥。",
			"六五，震往来，厉，亿无丧，有事。",
			"上六，震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}
	guas["五十二"] = Gua{
		Name:  "艮",
		GuaCi: "艮：艮其背，不获其身，行其庭，不见其人，无咎。",
		YaoCi: []string{
			"初六，艮其趾，无咎，利永贞。",
			"六二，艮其腓，不拯其随，其心不快。",
			"九三，艮其限，列其夤，厉，熏心。",
			"六四，艮其身，无咎。",
			"六五，艮其辅，言有序，悔亡。",
			"上九，敦艮，吉。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["五十三"] = Gua{
		Name:  "渐",
		GuaCi: "渐：女归吉，利贞",
		YaoCi: []string{
			"初六，鸿渐于干，小子厉，有言无咎。",
			"六二，鸿渐于磐，饮食行街，吉。",
			"九三，鸿渐于陆，夫征不复，妇孕不育，凶;利御寇。",
			"六四，鸿渐于木，或得其桷，无咎。",
			"九五，鸿渐于陵，妇三岁不孕;终莫之胜，吉。",
			"上九，鸿渐于陆，其羽可用为仪，吉",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["五十四"] = Gua{
		Name:  "归妹",
		GuaCi: "归妹：征凶，无攸利。",
		YaoCi: []string{
			"初九，归妹以娣，跛能履，征吉。",
			"九二，眇能视，利幽人之贞。",
			"六三，归妹以须，反归以娣。",
			"九四，归妹愆期，迟归有时。",
			"九五，帝乙归妹，其君之袂，不如其娣之袂良。月几望，吉。",
			"上九，女承筐无实，士刲羊无血，无攸利。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["五十五"] = Gua{
		Name:  "丰",
		GuaCi: "丰：亨，王假之，勿忧，宜日中。",
		YaoCi: []string{
			"初九，遇其配主，虽旬无咎，往有尚。",
			"六二，丰其蔀，日中见斗，往得疑疾，有孚发若，吉。",
			"九三，丰其沛，日中见沫，折其右肱，无咎。",
			"九四，丰其蔀，日中见斗，遇其夷主，吉。",
			"六五，来章，有庆誉，吉。",
			"上六，丰其屋，蔀其家，窥其户，阒其无人，三岁不觌，凶。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["五十六"] = Gua{
		Name:  "旅",
		GuaCi: "旅：小亨，旅贞吉。",
		YaoCi: []string{
			"初六，旅琐琐，斯其所取灾。",
			"六二，旅即次，怀其资，得童仆贞。",
			"九三，旅焚其次，丧其童仆，贞厉。",
			"九四，旅于处，得其资斧，我心不快。",
			"六五，射雉一矢亡，终以誉命。",
			"上九，鸟焚其巢，旅人先笑后号啕。丧牛于易，凶。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["五十七"] = Gua{
		Name:  "巽",
		GuaCi: "巽：小亨，利攸往，利见大人。",
		YaoCi: []string{
			"初六，进退，利武人之贞。",
			"九二，巽在床下，用史巫纷若，吉无咎。",
			"九三，频巽，吝。",
			"六四，悔亡，田获三品。",
			"九五，贞吉悔亡，无不利，无初有终，先庚三日，后庚三日，吉。",
			"上九，巽在床下，丧其资斧，贞凶。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["五十八"] = Gua{
		Name:  "兑",
		GuaCi: "兑：亨，利贞。",
		YaoCi: []string{
			"初九，和兑，吉。",
			"九二，孚兑，吉，悔亡。",
			"六三，来兑，凶。",
			"九四，商兑，未宁，介疾有喜。",
			"九五，孚于剥，有厉。",
			"上六，引兑。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["五十九"] = Gua{
		Name:  "涣",
		GuaCi: "涣：亨。王假之，勿忧，宜日中。",
		YaoCi: []string{
			"初六，遇其配主，虽旬无咎，往有尚。",
			"九二，眇能视，利幽人之贞。",
			"六三，归妹以须，反归以娣。",
			"九四，归妹愆期，迟归有时。",
			"九五，帝乙归妹，其君之袂，不如其娣之袂良。月几望，吉。",
			"上九，女承筐无实，士刲羊无血，无攸利。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["六十"] = Gua{
		Name:  "节",
		GuaCi: "节：亨，苦节不可贞。",
		YaoCi: []string{
			"初九，不出户庭，无咎。",
			"九二，不出门庭，凶。",
			"六三，不节若，则嗟若，无咎。",
			"六四，安节，亨。",
			"九五，甘节，吉；往有尚。",
			"上六，苦节，贞凶，悔亡。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["六十一"] = Gua{
		Name:  "中孚",
		GuaCi: "中孚：豚鱼吉，利涉大川，利贞。",
		YaoCi: []string{
			"初九，虞吉，有它不燕。",
			"九二，鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。",
			"六三，得敌，或鼓或罢，或泣或歌。",
			"六四，月几望，马匹亡，无咎。",
			"九五，有孚挛如，无咎。",
			"上九，翰音登于天，贞凶。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["六十二"] = Gua{
		Name:  "小过",
		GuaCi: "小过：亨，利贞，可小事，不可大事。飞鸟遗之音，不宜上宜下，大吉。",
		YaoCi: []string{
			"初六，飞鸟以凶。",
			"六二，过其祖，遇其妣，不及其君，遇其臣，无咎。",
			"九三，弗过防之，从或戕之，凶。",
			"九四，无咎，弗过遇之。往厉必戒，勿用永贞。",
			"六五，密云不雨，自我西郊，公弋取彼在穴。",
			"上六，弗遇过之，飞鸟离之，凶，是谓灾眚。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["六十三"] = Gua{
		Name:  "既济",
		GuaCi: "既济：亨，小利贞，初吉终乱。",
		YaoCi: []string{
			"初九，曳其轮，濡其尾，无咎。",
			"六二，妇丧其茀，勿逐，七日得。",
			"九三，高宗伐鬼方，三年克之，小人勿用。",
			"六四，直方大，不习无不利。",
			"九五，丧羊于易，无悔。",
			"上六，羝羊触藩，不能退，不能遂，无攸利，艰则吉。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}

	guas["六十四"] = Gua{
		Name:  "未济",
		GuaCi: "未济：亨，小狐汔济，濡其尾，无攸利。",
		YaoCi: []string{
			"初九，濡其尾，吝。",
			"九二，曳其轮，贞吉。",
			"六三，未济，征凶，利涉大川。",
			"九四，贞吉，悔亡，震用伐鬼方，三年有赏于大国。",
			"六五，贞吉，无悔，君子之光，有孚吉。",
			"上九，有孚于饮酒，无咎，濡其首，有孚失是。",
		},
		GuaCiJieXi: "",
		YuYi:       "",
	}
	return guas
}

// 八卦和对应的符号
var guaSymbols = map[string]string{
	"111": "☰",
	"000": "☷",
	"001": "☳",
	"110": "☴",
	"010": "☵",
	"101": "☲",
	"100": "☶",
	"011": "☱",
}

// 八卦符号对应的卦象
var guaNames = map[string]string{
	"111": "乾",
	"000": "坤",
	"001": "震",
	"110": "巽",
	"010": "坎",
	"101": "离",
	"100": "艮",
	"011": "兑",
}

var guaxuTable = [][]string{
	{"一", "三十四", "五", "二十六", "十一", "九", "十四", "四十三"},
	{"二十五", "五十一", "三", "二十七", "二十四", "四十二", "二十一", "十七"},
	{"六", "四十", "二十九", "四", "七", "五十九", "六十四", "四十七"},
	{"三十三", "六十二", "三十九", "五十二", "十五", "五十三", "五十六", "三十一"},
	{"十二", "十六", "八", "二十三", "二", "二十", "三十五", "四十五"},
	{"四十四", "三十二", "四十八", "十八", "四十六", "五十七", "五十", "二十八"},
	{"十三", "五十五", "六十三", "二十二", "三十六", "三十七", "三十", "四十九"},
	{"十", "五十四", "六十", "四十一", "十九", "六十一", "三十八", "五十八"},
}

var guaxuIndexs = map[string]string{
	"111": "0",
	"001": "1",
	"010": "2",
	"100": "3",
	"000": "4",
	"110": "5",
	"101": "6",
	"011": "7",
}

// 生成一个爻画。一个爻画会有三个爻。
func generateYaoHua() string {
	coins := [3]int{rand.Intn(2), rand.Intn(2), rand.Intn(2)}
	// 统计阳爻的数量
	yangCount := 0
	// 如果result的值为1，则表示是阳爻。为0表是阴爻
	for _, result := range coins {
		// 如果出现的阳爻，则yangCount的数量加一
		if result == 1 {
			yangCount++
		}
	}
	// 根据得到的结果，来返回当前得到的爻画。
	switch yangCount {
	// 如果阳爻数量为0，则表示为老阳
	case 0:
		return "老阳"
	// 如果阳爻数量为1，则表示为少阴
	case 1:
		return "少阴"
	// 如果阳爻数量为2，则表示为少阳
	case 2:
		return "少阳"
	// 如果阳爻数量为3，则表示是老阴
	case 3:
		return "老阴"
	}
	// 默认情况，返回老阳
	return "老阳"
}

// 生成一个卦,一个卦有六个爻画
func generateGua() []string {
	var gua []string
	// 生成六个爻画
	for i := 0; i < 6; i++ {
		// 循环六次，每次生成一个爻画，并保存到字符串数组中。每一个爻画为少阳、少阴、老阳、老阴中的一种
		yao := generateYaoHua()
		gua = append(gua, yao)
	}
	// 返回生成的卦
	return gua
}

// 生成一个卦,一个卦有六个爻画
func getBianGua(gua []string) []string {
	result := make([]string, len(gua))
	for i, str := range gua {
		// 判断字符串是否为老阴或老阳
		if str == "老阴" {
			result[i] = "老阳"
		} else if str == "老阳" {
			result[i] = "老阴"
		} else {
			// 如果字符串不是老阴或老阳，则保持不变
			result[i] = str
		}
	}
	return result
}

// 将字符串数组中的字符转换为对应的数字（少阳/老阳为1，少阴/老阴为0），然后拼接成一个字符串返回
func convertGuaToString(gua []string) string {
	result := ""
	for _, yao := range gua {
		// 判断字符是否为少阳或老阳
		if yao == "少阳" || yao == "老阳" {
			result += "1"
		} else { // 其他情况记为0
			result += "0"
		}
	}

	return result
}

// 根据变爻数量返回结果
func getBianYaoResult(gua []string) (string, interface{}) {
	// gua数组中，是从上到下来排列的
	// 统计老阳和老阴的数量
	var oldCount int
	for _, yao := range gua {
		if yao == "老阳" || yao == "老阴" {
			oldCount++
		}
	}
	bianYaoCount := oldCount
	// bianYaoIndices用来记录变爻的下标
	bianYaoIndices := make([]int, 0)

	// 找出变爻的下标
	for i, yao := range gua {
		if yao == "老阳" || yao == "老阴" {
			bianYaoIndices = append(bianYaoIndices, i)
		}
	}

	// 通过分析bianYaoCount的值，来开始解卦
	switch bianYaoCount {
	case 0:
		return "0爻", "静卦"
	case 1:
		return "1爻", bianYaoIndices[0]
	case 2:
		return "2爻", bianYaoIndices
	case 3:
		return "3爻", "本卦与变卦"
	case 4:
		nonBianYaoIndices := make([]int, 0)
		for i := range gua {
			if !contains(bianYaoIndices, i) {
				nonBianYaoIndices = append(nonBianYaoIndices, i)
			}
		}
		return "4爻", nonBianYaoIndices
	case 5:
		nonBianYaoIndices := make([]int, 0)
		for i := range gua {
			if !contains(bianYaoIndices, i) {
				nonBianYaoIndices = append(nonBianYaoIndices, i)
			}
		}
		return "5爻", nonBianYaoIndices[0]
	case 6:
		// 判断是否为全老阳或全老阴
		allOldYang := true
		allOldYin := true
		for _, yao := range gua {
			if yao != "老阳" {
				allOldYang = false
			}
			if yao != "老阴" {
				allOldYin = false
			}
		}
		if allOldYang {
			return "6爻乾", "用九"
		} else if allOldYin {
			return "6爻坤", "用六"
		} else {
			return "6爻", "变卦"
		}
	default:
		return "未知爻", "未知结果"
	}
}

// 判断一个切片中是否包含某个元素
func contains(slice []int, item int) bool {
	for _, value := range slice {
		if value == item {
			return true
		}
	}
	return false
}

// 主函数
func main() {
	initGuas := initializeGuas()
	rand.Seed(time.Now().UnixNano())

	// 定义 HTTP 路由处理函数
	http.HandleFunc("/test", func(w http.ResponseWriter, r *http.Request) {
		// 生成卦象
		gua := generateGua()
		upperGua := gua[:3]
		lowerGua := gua[3:]
		// 得到上卦和下卦以后，由于每个爻画可能存在老阳和老阴的情况。所以要将其转换为二进制来处理，避免混乱
		upperGuaStr := convertGuaToString(upperGua)
		lowerGuaStr := convertGuaToString(lowerGua)
		numY, err := strconv.Atoi(guaxuIndexs[upperGuaStr])
		if err != nil {
			fmt.Println("转换失败:", err)
			return
		}

		numX, err := strconv.Atoi(guaxuIndexs[lowerGuaStr])
		if err != nil {
			fmt.Println("转换失败:", err)
			return
		}
		fmt.Println("从卦序表中找到的卦序为", guaxuTable[numX][numY])
		guaXuNumber := guaxuTable[numX][numY]

		fmt.Println("开始解卦")
		// 得到卦序（也是得到了卦名）
		// 接下来就是要开始解析。
		// 首先先判断当前的卦象中，到底有几个变爻。然后根据变爻的数量和解卦
		resultType, result := getBianYaoResult(gua)

		// 根据解析结果返回 HTTP 响应
		switch resultType {
		case "0爻":
			fmt.Println("0变爻，解卦结果为")
			fmt.Println(initGuas[guaXuNumber].Name + "卦")
			fmt.Println(initGuas[guaXuNumber].GuaCi)
		case "1爻":
			strResult, ok := result.(int)
			if !ok {
				fmt.Println("接口的动态类型不是字符串类型")
				return
			}
			fmt.Println("1变爻，解卦结果为")
			fmt.Println(initGuas[guaXuNumber].Name + "卦")
			fmt.Println(initGuas[guaXuNumber].YaoCi[5-strResult])
		case "2爻":
			intArrayResult, ok := result.([]int)
			if !ok {
				fmt.Println("接口的动态类型不是 []int 类型")
				return
			}
			fmt.Println("2变爻，解卦结果为")
			fmt.Println(initGuas[guaXuNumber].Name + "卦")
			fmt.Println(initGuas[guaXuNumber].YaoCi[5-intArrayResult[0]])
			fmt.Println(initGuas[guaXuNumber].YaoCi[5-intArrayResult[1]])
		case "3爻":
			// 然后得到本卦的变卦
			biangua := getBianGua(gua)
			// 得到变卦以后，同样通过上卦和下卦得到卦序
			// 得到上卦和下卦，然后根据上卦和下卦，去卦序表中找到卦序和卦名
			upperBiangua := biangua[:3]
			lowerBiangua := biangua[3:]
			// 得到上卦和下卦以后，由于每个爻画可能存在老阳和老阴的情况。所以要将其转换为二进制来处理，避免混乱
			upperBianGuaStr := convertGuaToString(upperBiangua)
			lowerBianGuaStr := convertGuaToString(lowerBiangua)
			numBianGuaY, err := strconv.Atoi(guaxuIndexs[upperBianGuaStr])
			if err != nil {
				fmt.Println("转换失败:", err)
				return
			}
			numBianGuaX, err := strconv.Atoi(guaxuIndexs[lowerBianGuaStr])
			if err != nil {
				fmt.Println("转换失败:", err)
				return
			}
			guaxuBianGuaNumber := guaxuTable[numBianGuaX][numBianGuaY]
			fmt.Println("3变爻，解卦结果为")
			fmt.Println(initGuas[guaXuNumber].Name + "卦")
			fmt.Println(initGuas[guaXuNumber].GuaCi)
			fmt.Println(initGuas[guaxuBianGuaNumber].GuaCi)

		case "4爻":
			intArrayResult, ok := result.([]int)
			if !ok {
				fmt.Println("接口的动态类型不是 []int 类型")
				return
			}
			fmt.Println("4变爻，解卦结果为")
			fmt.Println(initGuas[guaXuNumber].Name + "卦")
			fmt.Println(initGuas[guaXuNumber].YaoCi[5-intArrayResult[1]])
			fmt.Println(initGuas[guaXuNumber].YaoCi[5-intArrayResult[0]])

		case "5爻":
			strResult, ok := result.(int)
			if !ok {
				fmt.Println("接口的动态类型不是字符串类型")
				return
			}
			fmt.Println("5变爻，解卦结果为")
			fmt.Println(initGuas[guaXuNumber].Name + "卦")
			fmt.Println(initGuas[guaXuNumber].YaoCi[5-strResult])
		case "6爻乾":
			fmt.Println("6变爻乾卦，解卦结果为")
			fmt.Println("用九: 群龙无首，人人皆龙，没有一个以首领自居，和平共处，吉祥。刚健者勇于进取，但咄咄逼人;柔顺者亲切宽厚，但软弱被动。兼具阳刚柔阴之德，真可谓尽善尽美了")
		case "6爻坤":
			fmt.Println("6变爻坤卦，解卦结果为")
			fmt.Println("用六：有利于永远守持正道。	阴柔之性中带有阳刚之质，这无疑有利于永久守持坤之正道")
		case "6爻":
			fmt.Println("6变爻，解卦结果为")
			// 然后得到本卦的变卦
			biangua := getBianGua(gua)
			// 得到变卦以后，同样通过上卦和下卦得到卦序
			// 得到上卦和下卦，然后根据上卦和下卦，去卦序表中找到卦序和卦名
			upperBiangua := biangua[:3]
			lowerBiangua := biangua[3:]
			// 得到上卦和下卦以后，由于每个爻画可能存在老阳和老阴的情况。所以要将其转换为二进制来处理，避免混乱
			upperBianGuaStr := convertGuaToString(upperBiangua)
			lowerBianGuaStr := convertGuaToString(lowerBiangua)

			numBianGuaY, err := strconv.Atoi(guaxuIndexs[upperBianGuaStr])
			if err != nil {
				fmt.Println("转换失败:", err)
				return
			}

			numBianGuaX, err := strconv.Atoi(guaxuIndexs[lowerBianGuaStr])
			if err != nil {
				fmt.Println("转换失败:", err)
				return
			}
			guaxuBianGuaNumber := guaxuTable[numBianGuaX][numBianGuaY]
			fmt.Println(initGuas[guaXuNumber].Name + "卦")
			fmt.Printf(initGuas[guaxuBianGuaNumber].GuaCi)
		default:
			fmt.Println("未知结果。")
		}
	})

	// 启动 HTTP 服务器并监听端口
	fmt.Println("服务器已启动，监听端口 8080")
	http.ListenAndServe(":8080", nil)

	//fmt.Println("欢迎使用易经算卦程序！请输入您的问题：")
	//var question string
	//_, err := fmt.Scanln(&question)
	//if err != nil {
	//	return
	//}
	//fmt.Println("正在算卦，请稍等...")
	//// 生成卦象
	//gua := generateGua()
	//fmt.Println("您的卦象为：")
	//for i, yao := range gua {
	//	fmt.Printf("%d爻：%s\n", i+1, yao)
	//}
	//fmt.Println("")
	// 得到上卦和下卦，然后根据上卦和下卦，去卦序表中找到卦序和卦名
	//upperGua := gua[:3]
	//lowerGua := gua[3:]
	//// 得到上卦和下卦以后，由于每个爻画可能存在老阳和老阴的情况。所以要将其转换为二进制来处理，避免混乱
	//upperGuaStr := convertGuaToString(upperGua)
	//lowerGuaStr := convertGuaToString(lowerGua)

	//fmt.Println("上卦为", upperGuaStr, guaNames[upperGuaStr], guaSymbols[upperGuaStr])
	//fmt.Println("下卦为", lowerGuaStr, guaNames[lowerGuaStr], guaSymbols[lowerGuaStr])

	//numY, err := strconv.Atoi(guaxuIndexs[upperGuaStr])
	//if err != nil {
	//	fmt.Println("转换失败:", err)
	//	return
	//}
	//
	//numX, err := strconv.Atoi(guaxuIndexs[lowerGuaStr])
	//if err != nil {
	//	fmt.Println("转换失败:", err)
	//	return
	//}
	//fmt.Println("从卦序表中找到的卦序为", guaxuTable[numX][numY])
	//guaXuNumber := guaxuTable[numX][numY]
	//
	//fmt.Println("开始解卦")
	//// 得到卦序（也是得到了卦名）
	//// 接下来就是要开始解析。
	//// 首先先判断当前的卦象中，到底有几个变爻。然后根据变爻的数量和解卦
	//resultType, result := getBianYaoResult(gua)
	//fmt.Println("变爻数量为")
	//fmt.Println(resultType)
	//fmt.Println("对应的下标为（从上到下，从0开始）")
	//fmt.Println(result)

	//switch resultType {
	//case "0爻":
	//	fmt.Println("0变爻，解卦结果为")
	//	fmt.Println(initGuas[guaXuNumber].Name + "卦")
	//	fmt.Println(initGuas[guaXuNumber].GuaCi)
	//case "1爻":
	//	strResult, ok := result.(int)
	//	if !ok {
	//		fmt.Println("接口的动态类型不是字符串类型")
	//		return
	//	}
	//	fmt.Println("1变爻，解卦结果为")
	//	fmt.Println(initGuas[guaXuNumber].Name + "卦")
	//	fmt.Println(initGuas[guaXuNumber].YaoCi[5-strResult])
	//case "2爻":
	//	intArrayResult, ok := result.([]int)
	//	if !ok {
	//		fmt.Println("接口的动态类型不是 []int 类型")
	//		return
	//	}
	//	fmt.Println("2变爻，解卦结果为")
	//	fmt.Println(initGuas[guaXuNumber].Name + "卦")
	//	fmt.Println(initGuas[guaXuNumber].YaoCi[5-intArrayResult[0]])
	//	fmt.Println(initGuas[guaXuNumber].YaoCi[5-intArrayResult[1]])
	//case "3爻":
	//	// 然后得到本卦的变卦
	//	biangua := getBianGua(gua)
	//	// 得到变卦以后，同样通过上卦和下卦得到卦序
	//	// 得到上卦和下卦，然后根据上卦和下卦，去卦序表中找到卦序和卦名
	//	upperBiangua := biangua[:3]
	//	lowerBiangua := biangua[3:]
	//	// 得到上卦和下卦以后，由于每个爻画可能存在老阳和老阴的情况。所以要将其转换为二进制来处理，避免混乱
	//	upperBianGuaStr := convertGuaToString(upperBiangua)
	//	lowerBianGuaStr := convertGuaToString(lowerBiangua)
	//	numBianGuaY, err := strconv.Atoi(guaxuIndexs[upperBianGuaStr])
	//	if err != nil {
	//		fmt.Println("转换失败:", err)
	//		return
	//	}
	//	numBianGuaX, err := strconv.Atoi(guaxuIndexs[lowerBianGuaStr])
	//	if err != nil {
	//		fmt.Println("转换失败:", err)
	//		return
	//	}
	//	guaxuBianGuaNumber := guaxuTable[numBianGuaX][numBianGuaY]
	//	fmt.Println("3变爻，解卦结果为")
	//	fmt.Println(initGuas[guaXuNumber].Name + "卦")
	//	fmt.Println(initGuas[guaXuNumber].GuaCi)
	//	fmt.Println(initGuas[guaxuBianGuaNumber].GuaCi)
	//
	//case "4爻":
	//	intArrayResult, ok := result.([]int)
	//	if !ok {
	//		fmt.Println("接口的动态类型不是 []int 类型")
	//		return
	//	}
	//	fmt.Println("4变爻，解卦结果为")
	//	fmt.Println(initGuas[guaXuNumber].Name + "卦")
	//	fmt.Println(initGuas[guaXuNumber].YaoCi[5-intArrayResult[1]])
	//	fmt.Println(initGuas[guaXuNumber].YaoCi[5-intArrayResult[0]])
	//
	//case "5爻":
	//	strResult, ok := result.(int)
	//	if !ok {
	//		fmt.Println("接口的动态类型不是字符串类型")
	//		return
	//	}
	//	fmt.Println("5变爻，解卦结果为")
	//	fmt.Println(initGuas[guaXuNumber].Name + "卦")
	//	fmt.Println(initGuas[guaXuNumber].YaoCi[5-strResult])
	//case "6爻乾":
	//	fmt.Println("6变爻乾卦，解卦结果为")
	//	fmt.Println("用九: 群龙无首，人人皆龙，没有一个以首领自居，和平共处，吉祥。刚健者勇于进取，但咄咄逼人;柔顺者亲切宽厚，但软弱被动。兼具阳刚柔阴之德，真可谓尽善尽美了")
	//case "6爻坤":
	//	fmt.Println("6变爻坤卦，解卦结果为")
	//	fmt.Println("用六：有利于永远守持正道。	阴柔之性中带有阳刚之质，这无疑有利于永久守持坤之正道")
	//case "6爻":
	//	fmt.Println("6变爻，解卦结果为")
	//	// 然后得到本卦的变卦
	//	biangua := getBianGua(gua)
	//	// 得到变卦以后，同样通过上卦和下卦得到卦序
	//	// 得到上卦和下卦，然后根据上卦和下卦，去卦序表中找到卦序和卦名
	//	upperBiangua := biangua[:3]
	//	lowerBiangua := biangua[3:]
	//	// 得到上卦和下卦以后，由于每个爻画可能存在老阳和老阴的情况。所以要将其转换为二进制来处理，避免混乱
	//	upperBianGuaStr := convertGuaToString(upperBiangua)
	//	lowerBianGuaStr := convertGuaToString(lowerBiangua)
	//
	//	numBianGuaY, err := strconv.Atoi(guaxuIndexs[upperBianGuaStr])
	//	if err != nil {
	//		fmt.Println("转换失败:", err)
	//		return
	//	}
	//
	//	numBianGuaX, err := strconv.Atoi(guaxuIndexs[lowerBianGuaStr])
	//	if err != nil {
	//		fmt.Println("转换失败:", err)
	//		return
	//	}
	//	guaxuBianGuaNumber := guaxuTable[numBianGuaX][numBianGuaY]
	//	fmt.Println(initGuas[guaXuNumber].Name + "卦")
	//	fmt.Printf(initGuas[guaxuBianGuaNumber].GuaCi)
	//default:
	//	fmt.Println("未知结果。")
	//}

}
